fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбоненсткойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
//ВКМ 14.01.26 Добавление в форму новых реквизитов при выюоре Вида договора "Абонентское обслуживание" 

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
    
    ОпределитьВидимостьЭлементов(); 
    
КонецПроцедуры  

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)  
    
    ОпределитьВидимостьЭлементов(); 
    
КонецПроцедуры  

&НаСервере
Процедура ОпределитьВидимостьЭлементов()
    
    Если  Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")Тогда
        
        Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина; 
        Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина; 
        Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Истина; 
        Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Истина; 
    Иначе
        Объект.ВКМ_ДатаНачалаДействияДоговора = Неопределено; 
        Объект.ВКМ_ДатаОкончанияДействияДоговора = Неопределено; 
        Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста = Неопределено; 
        Объект.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты = Неопределено; 
        Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;  
        Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь; 
        Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь; 
        Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Ложь; 
    КонецЕсли; 
    
КонецПроцедуры

//ВКМ 14.01.26 Конец добавления
